[
  {
    "title": "NEW ME IN PROGRESSS",
    "body": "bastaaa, subi unas historias donde me encanta como se ve mi pelo, mi cara, todo. definitivamente estoy cambiando, nuevo haircut, nuevo username; no más spicelui, no mas corte de librito. Como dirian las newjeans: look is a new me, switched up, who’s this?",
    "date": "19 oct 2025, 12:24 a.m.",
    "id": 15
  },
  {
    "title": "",
    "body": "hello, acabo de despertar hace 30 mins\nultimamente he estado grabandome para hacer tipo vlogs. ahorita estoy grabando uno :)\nestoy tratando de forzar mas y adaptarme a mi nueva personalidad.",
    "date": "17 oct 2025, 10:38 a.m.",
    "id": 14
  },
  {
    "title": "",
    "body": "ya casi no he estado escribiendo.. pero esq me da tanta hueva. CREO que el sábado iré a una pdita de halloween, digo creo porque aún no tengo el dinero ni mi disfraz bien planeado jahsj, pero ya hoy o mañana voy a pedirle el dinero a mi papá",
    "date": "16 oct 2025, 10:34 a.m.",
    "id": 13
  },
  {
    "title": ":/",
    "body": "pasó lo que nunca esperé. poniendonos en contexto, desde hace días he estado en una crisis existencial y social. desde hace días había estado teniendo sentimientos encontrados que había estado ignorando desde hace mucho.. y es que, ya no me siento tan cómodo estando con naye. o sea, no es que me sienta incómodo, pero a pesar de que aún puedo abrazarla y cosas así, siento que ya no conecto con ella en muchas cosas.",
    "date": "14 oct 2025, 8:32 p.m.",
    "id": 12
  },
  {
    "title": "",
    "body": "Osh se me olvidó lo que iba a hacer\nSolo quiero decir que estoy pensando en crear una pwa de rutina, pero ugh, se la pedí a chatgpt y se quedó atascado sin corregir el error de que no me jalaban los pasos. asiq, la voy a hacer pero después. También quiero hacerle unas mejoras a esta pwa, añadir la opción de añadir imagenes, archivos y grabar audios, y tal vez una opción de formato BOLD.",
    "date": "11 oct 2025, 10:59 p.m.",
    "id": 11
  },
  {
    "title": "",
    "body": "Siento que hoy desperdicié mi día. No avancé casi nada ayer y hoy de mi PWA :/\nMe la he pasado casi toodo el día viendo ‘Yo soy franky’, pero es tan dificil no dejar de ver YSF! el final de cada capitulo es so catchy\nY pues bueno, yo ya quiero terminar la PWA CECyTEQ 😭",
    "date": "11 oct 2025, 10:49 p.m.",
    "id": 10
  },
  {
    "title": "Conversación con ChatGPT",
    "body": "cambiando de tema, pues, ayer me fue bien, creo, aunque en la noche pues sí me tragué muchas emociones, pero ya equis, dije cambio de tema. estos ultimos dias me he mantenido ocupado diseñando la pwa del CECyTEQ+, que segun yo ya estaban listas unas paginas, no cambié el diseño pero cambié el flujo de navegación (jerarquía.\nno he conseguido ni he buscado trabajo. sobre eso y halloween estuve platicando en la mañana con chatgpt:\n\n“q hago? me siento estancado y estoy en una posición media donde no se decidir:(\nhaz de cuenta que va a ser halloween, faltan como 20 dias, quiero ir a una peda de halloween pero no sé de qué disfrazarme :/\ny no tengo nadotota de dinero ni ropa para mi disfraz, se supone que iba o voy a trabajar, pero si trabajo ya no me va a dar tiempo de hacer mi proyecto. el proyecto se entrega hasta mayo pero siento que lo estaría posponiendo mucho.\nsi me meto a trabajar en una papelería me pagarían semanalmente solo 1000 pesos por 6 horas, sin descanso ningun dia de la semana, entonces para mi no es nada … rentable? no me conviene. pero no se donde mas pueda trabajar teniendo 17 años y que me paguen mas, y aparte.. de aqui en lo q consigo tal vez desperdicio otra semana, y para halloween probablemente solo tendria 1000pesos pero siento q no seria suficiente. he pensado en ya no ir pero ya sabes, soy chavo y cada noche (en especial en dias festivos) cuenta y se tiene q aprovechar. al halloween iría con mi amiga, pero no estoy seguro de que me sentiría comodo, no por ella, si no por el ambiente, es como que me quiero poner pedo en una fiesta pero a la vez no pq se q mi amiga se estaría besando a alguien. ella dice q últimamente ya no hace eso, pero conociendola, puede pasar. estoy considerando en ir con algun otro amigo a otra peda. pero me siento mal pq se supone q ella es mi mejor amiga, últimamente ella es más abierta emocionalmente conmigo, so, me sentiría mal dejarla sola, aunq se q a ella tal vez no le importaría, no lo sé. estuvimos planeandolo y todo, pero ella ya fue el 2 de octubre creo a una peda, y a mi no me invitó sabes? entonces es como de.. bro. pero tal vez ella no me invitó porque ella quiere un dia mas cerca de la fecha de halloween, TAL VEZ. la verdad es de que si quiero ir, pero eso implica gasto en disfraz, uber, recarga, y cover/entrada. diria “voy a hacer el intento” pero probablemente no lo intente JJAJDKAJ, t digo q la unica razon por la que quisiera ir es para pasar un halloween con mi mejor amiga o disfrutar una noche de mi juventud. aparte por presion social de que voy a estar viendo en instagram q todos los chavos d mi edad tendran algo interesante q hacer ese dia.\nla peda no es fija, aun no se a cual voy a ir, para empezar, pero mi amiga ya tiene en lista varias, supongo. asiq la peda de halloween sería entre el 20 de octubre y 2 de noviembre. que piensas?\nno voy? si voy? me pongo a buscar chamba urgente? pospongo mi proyecto? aprovecho mi juentud y la oportunidad de ir con amigos?\ni mean, ahorita no voy a la escuela e ir seria oportunidad de salir de mi soledad y ampliar mi circulo social e lugar de estar aburrido en mi casa. pero eso implica presion con dinero, que facilmente podria evitar quedandome en casa tranqui viendo pelis de terror. pero te digo, eso de pelis podria hacerlo otro dia, otro año. este año es el ultimo en el que soy adolescente chico (tengo 17, voy a cumplir 18 y voy a ser adulto joven / adolescente mayor)\ny pues aaah ns, quiero pero no se”\n\n“estuve pensando, y, otra cosa, lo de la peda de halloween si es mas por presion social, y me di cuenta que si es eso.\nporque quiero de ahuevo peda\nporque quiero afuerzas un disfraz sexy y q no d lastima\ny pq quiero hacer solo ejercicio solo para presumir un pequeño avance en la pda y se me vean los cuadritos (q ahorita no tengo, pero se q si inicio hoy, si los consigo para halloween)\n💀\n\npero tmb la pda es pq, solo se vive una vez y no eres joven para toda la vida\n\ny es estoy haaarto de pasar halloween en mi casa viendo historias de como los demas se divierten sabes? ya me toca a mi”",
    "date": "10 oct 2025, 9:39 p.m.",
    "id": 8
  },
  {
    "title": "",
    "body": "mm, creo que ayer me precipité mucho en decir cosas horribles de mi papá, aunq todo es cierto, si me pasé..- no. no me pasé. bueno sí un poco :/ bno no\nhoy simplemente estuvo mas tranqui y como que sí tomó un poco en cuenta lo que ayer hablamos. salió y me compró un cinturón 😭, aunq mm mis problemas de confianza me dicen q suena un poco a manipulación emocional o para el demostrar algo. estoy agradecido? claro! pero mm equis, por ahora lo tomo como un gesto bueno :)",
    "date": "10 oct 2025, 9:33 p.m.",
    "id": 7
  },
  {
    "title": "discusión",
    "body": "ugh, hace rato estabamos mi mamá y yo discutiendo con mi papá. todo comenzó por una leche 😭 mi papá no sé q chingados pero se puso de loquito maniatico solo porque mi mamá le estaba diciendo de que la habiamos dejado sin q cenar. para no hacerla larga pues diré que mi papá comenzó a meter cosas nqver y siempre sus argumentos mierderos justificando lo que hace o no hace con sus traumitas del pasado que aun no supera.\ny yo solo diré que 1. me caga la actitud y la inmadurez de los piscis hombres. 2. q rico huele mi sudadera de la parte del cuello, huele como a un poco mango, algo de piña, vainilla, fresas y un chingo de azucar y caramelo. 3. mi papá se queja de algunas acciones o decisiones de mi mamá, pero yo siempre lo voy a culpar a el. por aué? porque yo sé que así mi mamá tuviera solo $50 ella me los daría y mi papá con $500 es capaz de no darme ni madres. a parte de que no solo eso, toda nuestra generación a partir de mis papás para delante (yo y mi hermana) estuvo jodida principalmente por su culpa, porque nunca le dio seguridad a mi mamá, nunca quizo cambiar, y siempre estuvo con su miedo todo estupido de fracasar y su falta de empatía y nunca hizo nada bueno de su vida, y sus traumas, pero lo que el no entiende es que eso es justo lo que jodió y sigue jodiendo todo, nunca se ha querido esforzar más porque es un cobarde de mierda. dice “si yo hubiera hecho lo que tu hiciste, mi papá me hubiera dado un buen fregadazo en la boca”, NO ENTIENDE QUE NO SON LAS MISMAS CIRCUSTANCIAS, así el mundo entero se lo dijera, no cambia y se hace el sinico y solo queda como un inmaduro todo idiota y cobarde bueno para nada. dice “no puedo contar contigo para nada” y así seguiré si el no cambia su actitud de mierda. luego pienso que tal vez yo tmb tengo la culpa por no dar el primer paso, pero realmente no, lo he dado y puede que si haya resultado, pero sigue con su misma actitud mierdera y sigue justificando sus errores con como lo criaron, sigue jodiendo con otras cosas. es una persona tan frustrada que nos cagó y sigue cagando varios años de la vida de mi mamá y literalmente toda nuestra vida de norma y mía. me detuve a pensar, mi mamá ahorita tuvo y tiene mas de $60mil pesos con los que facilmente podria hacerme una habitación, pero lo cierto es de que mi mamá ya lo hizo, está pagando una casa que mi papá no le pudo dar, tal vez no esté siendo habitada pero mi mamá siempre ha dado el primer paso y mi papá no responde bien.\nlo cierto es que mi papá está muy mal  mentalmente que es incapaz de reconocer sus errores sin hacerce el sinico. se ha vuelto tan egoista, o tal vez siempre lo fue y yo apenas desperté. dice que va a vender el terreno y que el se va a ocupar de su vejez, q le va a alcanzar con su pensión y la chingada pero no se pone a pensar en qué es lo que nos va a dejar a nosotros. y yo la verdad no tengo esperanzas de que cambie, solo sé que como va esto, el seguirá acostadote en la cama y como es un maldito conformista, va a morir de desnutrición y probablemente ocurra el dia en el que se quede dormido y no vuelva a despertar nunca más.",
    "date": "10 oct 2025, 12:36 a.m.",
    "id": 6
  },
  {
    "title": "",
    "body": "que ya se quite esta lluvia, diosss\nnecesito ya conseguir un trabajo porque si no no voy a tener el dinero suficiente para mi disfraz de halloween ! segun el pronostico de Apple, estará así hasta el sábado 😖\nSi no se quita para mañana, me va a valer cola y voy a ir a buscar trabajo así ajhsjs\nAhorita lo unico que me importa de la pwa CC+ es que esté el diseño y login terminado :)",
    "date": "9 oct 2025, 9:48 a.m.",
    "id": 5
  },
  {
    "title": "raining 🌧️",
    "body": "es un nuevo diaa, es de mañana y sigue super nublado y chispeando desde ayer.\nme dormi aprox a las 2am. tengo que comenzar a construir mejores hábitos 🤕.\nhoy si o sí tengo que terminar el diseño de la pwa de CECyTEQ+ 😼\nse me ocurrió que en lugar de hacer primero todos los diseños html+css o haciendo la pwa con la idea de que es un todo completo, simplemente separarlo como bloques independientes y al final solo enlazar la información; es decir, que primero voy a perfeccionar el login, luego lo de el horario, etc.",
    "date": "9 oct 2025, 9:36 a.m.",
    "id": 4
  },
  {
    "title": "rollercoaster",
    "body": "uff, muchas entradas, creo algo.. innecesarias jaja, pero bueno, me gustó haber creado esta app. bueno, la creó chatgpt realmente, pero yo la diseñé a mi estilo. vayamos al grano. hoy estuve ‘emocionalmente volátil’ según chat. inestable emocionalmente pues. y la nta no sé porqué. tal vez esto de no estar durmiendo bien ni comiendo bien ya me está afectando 😶‍🌫️. I mean, en la mañana estaba algo deprimido, despues a medio dia estuve muy irritable, después estuve muy off, hace rato que me cambié de ropa me sentí raramente mejor y mas comodo, me bañé y me sentí empoderado al verme en el espejo del baño, al terminar de bañarme (pero aun desnudo) estuve viendo ns q mmda de ios y su diseño, después no sé pero me comencé a tocar y me prendí. ahorita ya sali del baño, estoy con la misma ropa y me siento otra vez off, pero comodo.\nEn un momento volveré a lo de mi proyecto de titulación. Estoy escuchando música aún, por cierto:)",
    "date": "9 oct 2025, 1:59 a.m.",
    "id": 3
  },
  {
    "title": "dilema",
    "body": "ok estuve platicando con chatgpt sobre si estaría bien entregar el proyecto cuando realmente no lo hice estoy haciendo yo y estoy usando AI, y pues, en resumen, no está mal, ya que muchas cosas de las que voy a usar o implementar no me las enseñaron en la escuela, y las bases de datos q nos enseñaron a manejar son más locales que redes de intercomunicación en sí.\nA parte no está mal y no está hecho completamente por chat gpt, ya que yo organicé la jerarquía, he estado probando con diseños, yo pensé las funciones, la idea y el diseño son míos.",
    "date": "8 oct 2025, 6:58 p.m.",
    "id": 2
  },
  {
    "title": "new journal app ♡",
    "body": "ok, por ahora la ui es minimalista, ya me urgia un espacio propio que me gustara para hacer journaling 📖😭♡\ndescubri que para hacer el ‘one story a’ es con cv07 👁️👄👁️\nObvio esta app para hacerla rapido se lo pedi todo a chatgpt jahska, yo solo pulí algunos detallitos, pero ya, ya tenemos app propia 😭❤️\nhoy no me he sentido muy bien que digamos :/",
    "date": "8 oct 2025, 3:49 p.m.",
    "id": 1
  }
]